app/controllers/reference_materials_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 2)
---
  def index
    @reference_materials = ReferenceMaterial.find(:all, :include => [:categories], :conditions => [ 'categories.name <> ?', Category::PUBLIC_CATEGORY])

SELECT * FROM "reference_materials" WHERE ("reference_materials"."id" = 1)
---
  def set_reference_material
    @reference_material = ReferenceMaterial.find(params[:id] || params[:reference_material_id])