app/controllers/reference_materials_controller.rb

  def index
    @reference_materials = ReferenceMaterial.all
---
SELECT * FROM "reference_materials"