app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "password", "email") VALUES('2009-03-24 12:47:32', '2009-03-24 12:47:32', 'butia02', 'marcelo@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save